services/lms/app/controllers/lessons_controller.rb

  def create
    @lesson = @course.lessons.new(lesson_params)

    if @lesson.save
---
INSERT INTO "lessons" ("lesson_name", "lesson_description", "course_id", "created_at", "updated_at") VALUES ('Lesson Name 1', 'Lesson Description 1', '71d04e91-1a1e-4404-a1de-012becb7259e', '2025-11-03 18:05:03.190934', '2025-11-03 18:05:03.190934') RETURNING "id"

  def mark_complete
    lesson = Lesson.find_by_id(params.expect(:id))
    render json: {message: "Lesson Not Found"}, status: :not_found and return if lesson.nil?
    if lesson.update(completed: true)
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = '2c7e3640-e52a-49a7-86fd-53d7fcea459f' LIMIT 1
UPDATE "lessons" SET "updated_at" = '2025-11-03 18:20:37.975538', "completed" = TRUE WHERE "lessons"."id" = '2c7e3640-e52a-49a7-86fd-53d7fcea459f'

    def set_lesson
      begin
        @lesson = @course.lessons.find(params.expect(:id))
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = '71d04e91-1a1e-4404-a1de-012becb7259e'

    def set_course
      begin
        @course = Course.find(params.expect(:course_id))
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = '71d04e91-1a1e-4404-a1de-012becb7259e' LIMIT 1